; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	thermograph1 - mode
	image0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 127)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 108)
	(= (data Star3 thermograph2) 51)
	(= (data Phenomenon4 thermograph2) 118)
	(= (data Planet5 thermograph2) 76)
	(= (data Star6 thermograph2) 6)
	(= (data Star3 thermograph1) 53)
	(= (data Phenomenon4 thermograph1) 292)
	(= (data Planet5 thermograph1) 68)
	(= (data Star6 thermograph1) 56)
	(= (data Star3 image0) 155)
	(= (data Phenomenon4 image0) 124)
	(= (data Planet5 image0) 273)
	(= (data Star6 image0) 57)
	(= (slew_time Star1 GroundStation0) 39.18)
	(= (slew_time GroundStation0 Star1) 39.18)
	(= (slew_time GroundStation2 GroundStation0) 46.43)
	(= (slew_time GroundStation0 GroundStation2) 46.43)
	(= (slew_time GroundStation2 Star1) 5.346)
	(= (slew_time Star1 GroundStation2) 5.346)
	(= (slew_time Star3 GroundStation0) 10.58)
	(= (slew_time GroundStation0 Star3) 10.58)
	(= (slew_time Star3 Star1) 83.02)
	(= (slew_time Star1 Star3) 83.02)
	(= (slew_time Star3 GroundStation2) 31.72)
	(= (slew_time GroundStation2 Star3) 31.72)
	(= (slew_time Phenomenon4 GroundStation0) 69.05)
	(= (slew_time GroundStation0 Phenomenon4) 69.05)
	(= (slew_time Phenomenon4 Star1) 20.85)
	(= (slew_time Star1 Phenomenon4) 20.85)
	(= (slew_time Phenomenon4 GroundStation2) 57.6)
	(= (slew_time GroundStation2 Phenomenon4) 57.6)
	(= (slew_time Phenomenon4 Star3) 31.6)
	(= (slew_time Star3 Phenomenon4) 31.6)
	(= (slew_time Planet5 GroundStation0) 61.25)
	(= (slew_time GroundStation0 Planet5) 61.25)
	(= (slew_time Planet5 Star1) 7.024)
	(= (slew_time Star1 Planet5) 7.024)
	(= (slew_time Planet5 GroundStation2) 44.82)
	(= (slew_time GroundStation2 Planet5) 44.82)
	(= (slew_time Planet5 Star3) 2.001)
	(= (slew_time Star3 Planet5) 2.001)
	(= (slew_time Planet5 Phenomenon4) 13.49)
	(= (slew_time Phenomenon4 Planet5) 13.49)
	(= (slew_time Star6 GroundStation0) 40.91)
	(= (slew_time GroundStation0 Star6) 40.91)
	(= (slew_time Star6 Star1) 25.64)
	(= (slew_time Star1 Star6) 25.64)
	(= (slew_time Star6 GroundStation2) 4.478)
	(= (slew_time GroundStation2 Star6) 4.478)
	(= (slew_time Star6 Star3) 67.62)
	(= (slew_time Star3 Star6) 67.62)
	(= (slew_time Star6 Phenomenon4) 15.32)
	(= (slew_time Phenomenon4 Star6) 15.32)
	(= (slew_time Star6 Planet5) 5.342)
	(= (slew_time Planet5 Star6) 5.342)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star3 thermograph1)
	(have_image Phenomenon4 image0)
	(have_image Planet5 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 groundstation2 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 108 to 102.654, (fuel-used) from 0 to 5.346
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 102.654 to 98.176, (fuel-used) from 5.346 to 9.824
   goals met: 0 of 4
4. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 98.176 to 93.698, (fuel-used) from 9.824 to 14.302
   goals met: 0 of 4
5. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 93.698 to 89.22, (fuel-used) from 14.302 to 18.78
   goals met: 0 of 4
6. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 89.22 to 84.742, (fuel-used) from 18.78 to 23.258
   goals met: 0 of 4
7. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 84.742 to 80.264, (fuel-used) from 23.258 to 27.736
   goals met: 0 of 4
8. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 80.264 to 75.786, (fuel-used) from 27.736 to 32.214
   goals met: 0 of 4
9. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 75.786 to 71.308, (fuel-used) from 32.214 to 36.692
   goals met: 0 of 4
10. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 71.308 to 66.83, (fuel-used) from 36.692 to 41.17
   goals met: 0 of 4
11. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 66.83 to 62.352, (fuel-used) from 41.17 to 45.648
   goals met: 0 of 4
12. (turn_to satellite0 star1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 127 to 119.976, (fuel-used) from 45.648 to 52.672
   goals met: 0 of 4
13. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 62.352 to 57.874, (fuel-used) from 52.672 to 57.15
   goals met: 0 of 4
14. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 57.874 to 53.396, (fuel-used) from 57.15 to 61.628
   goals met: 0 of 4
15. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 53.396 to 48.918, (fuel-used) from 61.628 to 66.106
   goals met: 0 of 4
16. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 48.918 to 44.44, (fuel-used) from 66.106 to 70.584
   goals met: 0 of 4
17. (turn_to satellite1 groundstation2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 44.44 to 39.962, (fuel-used) from 70.584 to 75.062
   goals met: 0 of 4
18. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
19. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 4
20. (turn_to satellite1 star6 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 39.962 to 35.484, (fuel-used) from 75.062 to 79.54
   goals met: 0 of 4
21. (turn_to satellite1 phenomenon4 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 35.484 to 20.164, (fuel-used) from 79.54 to 94.86
   goals met: 0 of 4
22. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 4
23. (turn_to satellite0 planet5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 119.976 to 112.952, (fuel-used) from 94.86 to 101.884
   goals met: 0 of 4
24. (take_image satellite0 planet5 instrument0 thermograph1)
   added: (have_image planet5 thermograph1)
   changed: (data_capacity satellite0) from 1000 to 932, (data-stored) from 0 to 68
   goals met: 1 of 4
25. (turn_to satellite0 star3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 112.952 to 110.951, (fuel-used) from 101.884 to 103.885
   goals met: 1 of 4
26. (take_image satellite0 star3 instrument0 thermograph1)
   added: (have_image star3 thermograph1)
   changed: (data_capacity satellite0) from 932 to 879, (data-stored) from 68 to 121
   goals met: 2 of 4
27. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 110.951 to 100.371, (fuel-used) from 103.885 to 114.465
   goals met: 3 of 4
28. (take_image satellite1 phenomenon4 instrument1 image0)
   added: (have_image phenomenon4 image0)
   changed: (data_capacity satellite1) from 1000 to 876, (data-stored) from 121 to 245
   goals met: 4 of 4
